Repository: Mikael2983/OC_P13_Python-Lettings-FR
Catalog: docs/source/locales/*/LC_MESSAGES/installation.po
Languages: fr

source: Follow these steps to install and run **OC_lettings** locally.
fr: Suivez ces étapes pour installer et exécuter **OC_lettings** localement.

source: Prerequisites
fr: prérequis

source: Python 3.8 or higher
fr: Python 3.8 ou plus

source: A virtual environment (venv recommended)
fr: Un environnement virtuel (venv recommandé)

source: Steps
fr: Étapes

source: Clone the repository:
fr: Cloner le repository:

source: Create and activate a virtual environment:
fr: Créer et activer l'environnement virtuel:

source: Install dependencies:
fr: Installer les dépendances

source: Run migrations:
fr: effectuer les migrations

source: Start the local server:
fr: lancer le serveur local:

source: Access the application at:
fr: Accédez à l’application à:
