Repository: Mikael2983/OC_P13_Python-Lettings-FR
Catalog: docs/source/locales/*/LC_MESSAGES/modules.po
Languages: fr

source: This page documents the main modules of the **OC_lettings** project.
fr: Cette page documente les principaux modules du projet **OC_lettings**.

source: Overview
fr: Vue d'ensemble

source: The project is structured as a Django application with the following main modules:
fr: Le projet est structuré comme une application Django avec les principaux modules suivants :

source: Module Details
fr: détails des modules

source: This is the main Django project module, containing:
fr: Ceci est le module principal du projet Django, contenant:

source: `settings.py`: project settings, configuration, and environment variables
fr: `settings.py`: paramètres du projet, configuration et variables d’environnement

source: `urls.py`: main URL routing for the project
fr: `urls.py`: principal routage URL pour le projet

source: `wsgi.py`: WSGI entry point for deployment
fr: `wsgi.py`: point d’entrée WSGI pour le déploiement

source: `asgi.py`: ASGI entry point for asynchronous support
fr: `asgi.py`: point d’entrée ASGI pour le support asynchrone

source: lettings
fr: locations

source: This Django app handles rental listings. It includes:
fr: Cette application Django gère les listes de location. Elle inclut:

source: Models for property listings
fr: Modèles pour les annonces immobilières

source: Views for displaying listings
fr: Vues pour l’affichage des annonces

source: Templates for user interface
fr: templates pour l’interface utilisateur

source: profiles
fr: profils

source: This Django app manages user profiles. It includes:
fr: Cette application Django gère les profils utilisateurs. Elle inclut:

source: Models for users and profile information
fr: Modèles pour les utilisateurs et informations de profil

source: Views for displaying profiles
fr: Vues pour l’affichage des profils
