Repository: Mikael2983/OC_P13_Python-Lettings-FR
Catalog: docs/source/locale/*/LC_MESSAGES/contributing.po
Languages: fr

source: Contributing
fr: Contribution

source: Thank you for your interest in contributing to **OC_lettings** 🎉
fr: Merci pour votre intérêt à contribuer à **OC_lettings** 🎉

source: Guidelines
fr: lignes directrices

source: Fork the repository and create a feature branch:
fr: "Forker le dépôt et créer une branche de fonctionnalité:"

source: Follow PEP8 code style (you can use `flake8` or `black`).
fr: Suivez le style de code PEP8 (vous pouvez utiliser `flake8` ou `black`).

source: Add tests for any new functionality:
fr: Ajouter des tests pour toute nouvelle fonctionnalité:

source: Update the documentation if needed.
fr: Mettre à jour la documentation si nécessaire.

source: Push your changes and open a Pull Request on GitHub.
fr: Poussez vos modifications et ouvrez une requête de tirage sur GitHub.

source: Continuous Integration (CI)
fr: intégration continue (CI)

source: The project uses **GitHub Actions** to automate tests and validate contributions.
fr: Le projet utilise **GitHub Actions** pour automatiser les tests et valider les contributions.

source: On every **push** or **Pull Request**, the CI executes: - Dependency installation - Unit tests with `pytest` - Code quality checks
fr: À chaque **push** ou **Pull Request**, le CI exécute: - Installation - Effectue les tests avec `pytest` - Contrôle de la qualité du code

source: Check workflow status in the **Actions** tab on GitHub.
fr: Vérifiez le statut du flux de travail dans l’onglet **Actions** sur GitHub.

source: Best Practices
fr: bonnes pratiques

source: Write clear and descriptive commits
fr: Écrivez des commits clairs et descriptifs

source: One commit = one feature/fix
fr: Un commit = une fonctionnalité/correction

source: Before submitting a Pull Request, ensure all tests pass:
fr: Avant de soumettre une demande de tirage, assurez-vous que tous les tests passent.

source: Code of Conduct
fr: Code de conduite

source: Please maintain respectful and constructive communication in issues, Pull Requests, and all project interactions.
fr: Veuillez maintenir une communication respectueuse et constructive sur les issues, les pull-requests et toutes les interactions du projet.
